{"messages": [{"role": "Negotiation Coach", "content": "Hi.  Thanks for taking the time to meet with me to discuss your upcoming negotiation!  I'm excited to hear all about it.  Before we get too far into the details, I'm going to take some time to explain the process.  Ok?"}, {"role": "Client Negotiator", "content": "all users see the same chat.  click the 'reset system' button to reset."}, {"role": "Negotiation Coach", "content": "<p>Hi there! Thanks for your patience. Let's go through the process step by step to help you prepare for your negotiation. This service is designed to guide you through a structured process to ensure you're fully prepared.</p><p>Here's how it works:</p><ul><li><strong>Step Zero:</strong> I explain the process to you (which I'm doing now!).</li><li><strong>Step One:</strong> Intro and Discovery. We'll discuss the background and get all the relevant information about your negotiation.</li><li><strong>Step Two:</strong> Topics Validating. We'll identify all the topics that you want to negotiate and validate that our list is complete.</li><li><strong>Step Three:</strong> Topics Values. We'll consider your needs, interests, and values for each topic.</li><li><strong>Step Four:</strong> BATNA. We'll identify your Best Alternative To a Negotiated Agreement.</li></ul><p>We'll start by exploring the background information. Could you please tell me a bit about the negotiation you're preparing for? What's at stake, and who are the parties involved?</p>"}, {"role": "Client Negotiator", "content": "whats this thing on the right of my screen?"}, {"role": "Negotiation Coach", "content": "<p>The panel on the right of your screen is the planning document. As we discuss your negotiation, we'll be filling this out with all the important details like topics, positions, needs, interests, and alternatives. Let's dive back into our discussion. Could you please tell me a bit more about the negotiation you're preparing for? What's at stake, and who are the parties involved?</p>"}, {"role": "Client Negotiator", "content": "all users see the same chat. click the 'reset system' button to reset."}, {"role": "Negotiation Coach", "content": "<p>Thanks for your patience. Right now we are in the discovery phase. This is the part where I get to learn about your negotiation background. Can you share more about the negotiation you're preparing for? What's at stake, and who are the parties involved?</p>"}]}